let SPEED = 0.15; // モールス信号「・」の速さ

let currentMp3Blob = null; // 一番新しいmp3(Binary Large Object)
const channels = 1; //チャンネル数
let volume = 1; //音の大きさ
let frequency = 880; //モールスの音の高さ
let speedRatio = 1;
const lastOfCorrespond = "\n"; // モールス対応表の最後の文字

// 対応文字変更は未実装
let dot = "・"; // モールス信号の「・」
let dash = "－"; // モールス信号の「－」
let separator = "／"; // モールス信号の「／」
let unknown = "？"; // 未定義文字の記号

/*シェア用の文*/
const rawUrl = "https://piramura.github.io/MorseCodeUEC/";
let shareMessage_English = `I aced the Morse Code Quiz!📡\n\n▼Try converting it here!`;
let shareMessage_Japanese = `モールス信号クイズに正解したよ！📡\n\n▼ここで変換してみよう！`;
let hashTags_English = '#MorseCode #Quiz\n#UECCommunicationMuseum';
let hashTags_Japanese = '#モールス信号 #クイズ\n#UECコミュニケーションミュージアム';

/*=============================
=======  アラート関連  =========
============================== */
const scriptAlertMessages = {
  noInput: {
    '日本語': '何も入力されていません',
    'English': 'Nothing entered.'
  },
  emptyMorse: {
    '日本語': 'モールス信号が空です。\nモールス信号を入力してください。',
    'English': 'Morse code is empty.\nPlease enter Morse code.'
  },
  invalidMorse: {
    '日本語': '存在しないモールス信号が含まれています:\n',
    'English': 'Invalid Morse code detected:\n'
  },
  selectFile: {
    '日本語': 'ファイルを選択してください',
    'English': 'Please select a file.'
  },
  analysisFailed: {
    '日本語': '解析に失敗しました: ',
    'English': 'Analysis failed: '
  },
  noAnalysisResult: {
    '日本語': '解析結果がありません。まず音声を解析してください',
    'English': 'No analysis result. Please analyze audio first.'
  },
  noMorseAnalyzed: {
    '日本語': '解析されたモールスがありません。まず解析を実行してください。',
    'English': 'No analyzed Morse code. Please run analysis first.'
  },
  cannnotLINE: {
    '日本語': 'LINEアプリでは動作しない可能性があります。\nブラウザで開き直してください。',
    'English': 'This may not work in the LINE app.\nPlease reopen in a browser.'
  },
  nameEmpty: {
    '日本語': 'お名前を入力してください',
    'English': 'Please enter your name.'
  },
  noMorseToPlay: {
    '日本語': '再生するモールス信号がありません',
    'English': 'No Morse code to play.'
  },
  noMorseToDownload: {
    '日本語': 'ダウンロードするモールス信号がありません',
    'English': 'No Morse code to download.'
  },
  lineDownloadNotSupported: {
    '日本語': 'LINEのブラウザではMP3をダウンロードできません。別ブラウザでお試しください。',
    'English': 'MP3 download is not supported in LINE browser. Please try with another browser.'
  },
  mp3GenerationFailed: {
    '日本語': 'MP3の生成に失敗しました',
    'English': 'Failed to generate MP3.'
  },
  downloadCompleted: {
    '日本語': 'ダウンロード完了！',
    'English': 'Download completed!'
  },
  copyFailed: {
    '日本語': 'コピーできませんでした',
    'English': 'Failed to copy.'
  },
  noMorseToPlay2: {
    '日本語': 'コピーするモールス記号がありません',
    'English': 'No Morse code to copy.'
  },
  resetSettingsCompleted: {
    '日本語': '設定を初期値に戻しました。',
    'English': 'Settings have been reset to default values.'
  },
  prevScreenMorseConvert: {
    '日本語': '前の画面でモールス信号を変換してください。',
    'English': 'Please convert to Morse code on the previous screen.'
  },
  confirmReset: {
    '日本語': '設定を初期値に戻します。よろしいですか？',
    'English': 'Are you sure you want to reset settings to default?'
  }
};

function getScriptAlertMessage(key) {
  let lang = getCurrentLanguage();
  if(lang === "ローマ字"){lang = "日本語";}
  const messageObject = scriptAlertMessages[key];
  return messageObject[lang];
}

function showAlert(key, additionalMessage = "") {
  const message = getScriptAlertMessage(key) + additionalMessage;
  window.alert(message);
}

function getAlertMessage(key, additionalMessage = "") {
  const message = getScriptAlertMessage(key) + additionalMessage;
  return message;
}


/*=============================
=======  変換マップ関連  =======
============================== */
const RtH = {
    "qya":"くゃ","qyi":"くぃ","qyu":"くゅ","qye":"くぇ","qyo":"くょ",
    "wha":"うぁ","whi":"うぃ","whu":"う","whe":"うぇ","who":"うぉ",
    "rya":"りゃ","ryi":"りぃ","ryu":"りゅ","rye":"りぇ","ryo":"りょ",
    "tya":"ちゃ","tyi":"ちぃ","tyu":"ちゅ","tye":"ちぇ","tyo":"ちょ",
    "tha":"てゃ","thi":"てぃ","thu":"てゅ","the":"てぇ","tho":"てょ",
    "pya":"ぴゃ","pyi":"ぴぃ","pyu":"ぴゅ","pye":"ぴぇ","pyo":"ぴょ",
    "sha":"しゃ","shi":"し","shu":"しゅ","she":"しぇ","sho":"しょ",
    "sya":"しゃ","syi":"しぃ","syu":"しゅ","sye":"しぇ","syo":"しょ",
    "dya":"ぢゃ","dyi":"ぢぃ","dyu":"ぢゅ","dye":"ぢぇ","dyo":"ぢょ",
    "dha":"でゃ","dhi":"でぃ","dhu":"でゅ","dhe":"でぇ","dho":"でょ",
    "fya":"ふゃ","fyi":"ふぃ","fyu":"ふゅ","fye":"ふぇ","fyo":"ふょ",
    "gya":"ぎゃ","gyi":"ぎぃ","gyu":"ぎゅ","gye":"ぎぇ","gyo":"ぎょ",
    "kya":"きゃ","kyi":"きぃ","kyu":"きゅ","kye":"きぇ","kyo":"きょ",
    "hya":"ひゃ","hyi":"ひぃ","hyu":"ひゅ","hye":"ひぇ","hyo":"ひょ",
    "jya":"じゃ","jyi":"じぃ","jyu":"じゅ","jye":"じぇ","jyo":"じょ",
    "lya":"ゃ","lyi":"ぃ","lyu":"ゅ","lye":"ぇ","lyo":"ょ",
    "zya":"じゃ","zyi":"じぃ","zyu":"じゅ","zye":"じぇ","zyo":"じょ",
    "xya":"ゃ","xyi":"ぃ","xyu":"ゅ","xye":"ぇ","xyo":"ょ",
    "cha":"ちゃ","chi":"ち","chu":"ちゅ","che":"ちぇ","cho":"ちょ",
    "cya":"ちゃ","cyi":"ちぃ","cyu":"ちゅ","cye":"ちぇ","cyo":"ちょ",
    "vya":"ヴゃ","vyi":"ヴぃ","vyu":"ヴゅ","vye":"ヴぇ","vyo":"ヴょ",
    "bya":"びゃ","byi":"びぃ","byu":"びゅ","bye":"びぇ","byo":"びょ",
    "nya":"にゃ","nyi":"にぃ","nyu":"にゅ","nye":"にぇ","nyo":"にょ", 
    "mya":"みゃ","myi":"みぃ","myu":"みゅ","mye":"みぇ","myo":"みょ",
    "gwa":"ぐぁ","gwi":"ぐぃ","gwu":"ぐぅ","gwe":"ぐぇ","gwo":"ぐぉ",
    "swa":"すぁ","swi":"すぃ","swu":"すぅ","swe":"すぇ","swo":"すぉ",
    "kwa":"くぁ",
    
    "tsa":"つぁ","tsi":"つぃ","tsu":"つ","tse":"つぇ","tso":"つぉ", 
    "ja":"じゃ","ji":"じ","ju":"じゅ","je":"じぇ","jo":"じょ",
            
    "la":"ぁ","li":"ぃ","lu":"ぅ","le":"ぇ","lo":"ぉ",
    "xa":"ぁ","xi":"ぃ","xu":"ぅ","xe":"ぇ","xo":"ぉ","xn":"ん",
    "xtu":"っ","ltu":"っ",
            
    "xka":"ゕ","xke":"ゖ","xwa":"ゎ",
    "lka":"ゕ","lke":"ゖ","lwa":"ゎ",
            
    "ca":"か","ci":"し","cu":"く","ce":"せ","co":"こ",
    "qa":"くぁ","qi":"くぃ","qu":"く","qe":"くぇ","qo":"くぉ",
    "fa":"ふぁ","fi":"ふぃ","fu":"ふ","fe":"ふぇ","fo":"ふぉ",
    "va":"ゔぁ","vi":"ゔぃ","vu":"ゔ","ve":"ゔぇ","vo":"ゔぉ",
    
    "a":"あ","i":"い","u":"う","e":"え","o":"お",
    "ka":"か","ki":"き","ku":"く","ke":"け","ko":"こ",
    "ga":"が","gi":"ぎ","gu":"ぐ","ge":"げ","go":"ご",
    "sa":"さ","si":"し","su":"す","se":"せ","so":"そ",
    "za":"ざ","zi":"じ","zu":"ず","ze":"ぜ","zo":"ぞ",
    "ta":"た","ti":"ち","tu":"つ","te":"て","to":"と",
    "da":"だ","di":"ぢ","du":"づ","de":"で","do":"ど",
    "na":"な","ni":"に","nu":"ぬ","ne":"ね","no":"の",
    "ha":"は","hi":"ひ","hu":"ふ","he":"へ","ho":"ほ",
    "ba":"ば","bi":"び","bu":"ぶ","be":"べ","bo":"ぼ",
    "pa":"ぱ","pi":"ぴ","pu":"ぷ","pe":"ぺ","po":"ぽ",
    "ma":"ま","mi":"み","mu":"む","me":"め","mo":"も",
    "ya":"や","yi":"い","yu":"ゆ","ye":"いぇ","yo":"よ",
    "ra":"ら","ri":"り","ru":"る","re":"れ","ro":"ろ",
    "wa":"わ","wi":"ゐ","wu":"う","we":"ゑ","wo":"を",
    "n":"ん"
};

// ひらがなからローマ字に変更するためのマップ
const HtR = {
    "あ":"a", "い":"i", "う":"u", "え":"e", "お":"o",
    "か":"ka", "き":"ki", "く":"ku", "け":"ke", "こ":"ko",
    "さ":"sa", "し":"shi", "す":"su", "せ":"se", "そ":"so",
    "た":"ta", "ち":"chi", "つ":"tsu", "て":"te", "と":"to",
    "な":"na", "に":"ni", "ぬ":"nu", "ね":"ne", "の":"no",
    "は":"ha", "ひ":"hi", "ふ":"fu", "へ":"he", "ほ":"ho",
    "ま":"ma", "み":"mi", "む":"mu", "め":"me", "も":"mo",
    "や":"ya", "ゆ":"yu", "よ":"yo",
    "ら":"ra", "り":"ri", "る":"ru", "れ":"re", "ろ":"ro",
    "わ":"wa", "を":"wo", "ん":"nn",
    
    "が":"ga", "ぎ":"gi", "ぐ":"gu", "げ":"ge", "ご":"go",
    "ざ":"za", "じ":"ji", "ず":"zu", "ぜ":"ze", "ぞ":"zo",
    "だ":"da", "ぢ":"ji", "づ":"zu", "で":"de", "ど":"do",
    "ば":"ba", "び":"bi", "ぶ":"bu", "べ":"be", "ぼ":"bo",
    "ぱ":"pa", "ぴ":"pi", "ぷ":"pu", "ぺ":"pe", "ぽ":"po",
    
    "きゃ":"kya", "きゅ":"kyu", "きょ":"kyo",
    "しゃ":"sha", "しゅ":"shu", "しょ":"sho",
    "ちゃ":"cha", "ちゅ":"chu", "ちょ":"cho",
    "にゃ":"nya", "にゅ":"nyu", "にょ":"nyo",
    "ひゃ":"hya", "ひゅ":"hyu", "ひょ":"hyo",
    "みゃ":"mya", "みゅ":"myu", "みょ":"myo",
    "りゃ":"rya", "りゅ":"ryu", "りょ":"ryo",
    "ぎゃ":"gya", "ぎゅ":"gyu", "ぎょ":"gyo",
    "じゃ":"ja", "じゅ":"ju", "じょ":"jo",
    "ぢゃ":"dya", "ぢゅ":"dyu", "ぢょ":"dyo",
    "びゃ":"bya", "びゅ":"byu", "びょ":"byo",
    "ぴゃ":"pya", "ぴゅ":"pyu", "ぴょ":"pyo",
    
    "ぁ":"xa", "ぃ":"xi", "ぅ":"xu", "ぇ":"xe", "ぉ":"xo",
    "ゃ":"xya", "ゅ":"xyu", "ょ":"xyo", "っ":"xtu",
    "ゎ":"xwa",

    "ー": "-", "、": ",", "。": ".","？":"?","！":"!","＠":"@","＃":"#","$":"$","％":"%","＾":"^","＆":"&","＊":"*",
    "（":"(", "）":")", "「":"\"", "」":"\"", "『":"'", "』":"'", "：":":", "；":";", "＋":"+","－":"-","＝":"=","＜":"<","＞":">","／":"/","＼":"\\","｜":"|","〜":"~",

    //カタカナからローマ字も対応
    "ア":"a", "イ":"i", "ウ":"u", "エ":"e", "オ":"o",
    "カ":"ka", "キ":"ki", "ク":"ku", "ケ":"ke", "コ":"ko",
    "サ":"sa", "シ":"shi", "ス":"su", "セ":"se", "ソ":"so", 
    "タ":"ta", "チ":"chi", "ツ":"tsu", "テ":"te", "ト":"to",
    "ナ":"na", "ニ":"ni", "ヌ":"nu", "ネ":"ne", "ノ":"no",
    "ハ":"ha", "ヒ":"hi", "フ":"fu", "ヘ":"he", "ホ":"ho",
    "マ":"ma", "ミ":"mi", "ム":"mu", "メ":"me", "モ":"mo",
    "ヤ":"ya", "ユ":"yu", "ヨ":"yo",
    "ラ":"ra", "リ":"ri", "ル":"ru", "レ":"re", "ロ":"ro",
    "ワ":"wa", "ヲ":"wo", "ン":"nn",

    "ガ":"ga", "ギ":"gi", "グ":"gu", "ゲ":"ge", "ゴ":"go",
    "ザ":"za", "ジ":"ji", "ズ":"zu", "ゼ":"ze", "ゾ":"zo",
    "ダ":"da", "ヂ":"ji", "ヅ":"zu", "デ":"de", "ド":"do",
    "バ":"ba", "ビ":"bi", "ブ":"bu", "ベ":"be", "ボ":"bo",
    "パ":"pa", "ピ":"pi", "プ":"pu", "ペ":"pe", "ポ":"po",

    "キャ":"kya", "キュ":"kyu", "キョ":"kyo",
    "シャ":"sha", "シュ":"shu", "ショ":"sho",
    "チャ":"cha", "チュ":"chu", "チョ":"cho",
    "ニャ":"nya", "ニュ":"nyu", "ニョ":"nyo",
    "ヒャ":"hya", "ヒュ":"hyu", "ヒョ":"hyo",
    "ミャ":"mya", "ミュ":"myu", "ミョ":"myo",
    "リャ":"rya", "リュ":"ryu", "リョ":"ryo",
    "ギャ":"gya", "ギュ":"gyu", "ギョ":"gyo",
    "ジャ":"ja", "ジュ":"ju", "ジョ":"jo",
    "ヂャ":"dya", "ヂュ":"dyu", "ヂョ":"dyo",
    "ビャ":"bya", "ビュ":"byu", "ビョ":"byo",
    "ピャ":"pya", "ピュ":"pyu", "ピョ":"pyo",

    "ァ":"xa", "ィ":"xi", "ゥ":"xu", "ェ":"xe", "ォ":"xo",
    "ャ":"xya", "ュ":"xyu", "ョ":"xyo", "ッ":"xtu",
    "ヮ":"xwa",

    // 半角カタカナからローマ字も対応
    "ｱ":"a", "ｲ":"i", "ｳ":"u", "ｴ":"e", "ｵ":"o",
    "ｶ":"ka", "ｷ":"ki", "ｸ":"ku", "ｹ":"ke", "ｺ":"ko",
    "ｻ":"sa", "ｼ":"shi", "ｽ":"su", "ｾ":"se", "ｿ":"so",
    "ﾀ":"ta", "ﾁ":"chi", "ﾂ":"tsu", "ﾃ":"te", "ﾄ":"to",
    "ﾅ":"na", "ﾆ":"ni", "ﾇ":"nu", "ﾈ":"ne", "ﾉ":"no",
    "ﾊ":"ha", "ﾋ":"hi", "ﾌ":"fu", "ﾍ":"he", "ﾎ":"ho",
    "ﾏ":"ma", "ﾐ":"mi", "ﾑ":"mu", "ﾒ":"me", "ﾓ":"mo",
    "ﾔ":"ya", "ﾕ":"yu", "ﾖ":"yo",
    "ﾗ":"ra", "ﾘ":"ri", "ﾙ":"ru", "ﾚ":"re", "ﾛ":"ro",
    "ﾜ":"wa", "ｦ":"wo", "ﾝ":"nn",

    "ｶﾞ":"ga", "ｷﾞ":"gi", "ｸﾞ":"gu", "ｹﾞ":"ge", "ｺﾞ":"go",
    "ｻﾞ":"za", "ｼﾞ":"ji", "ｽﾞ":"zu", "ｾﾞ":"ze", "ｿﾞ":"zo",
    "ﾀﾞ":"da", "ﾁﾞ":"ji", "ﾂﾞ":"zu", "ﾃﾞ":"de", "ﾄﾞ":"do",
    "ﾊﾞ":"ba", "ﾋﾞ":"bi", "ﾌﾞ":"bu", "ﾍﾞ":"be", "ﾎﾞ":"bo",
    "ﾊﾟ":"pa", "ﾋﾟ":"pi", "ﾌﾟ":"pu", "ﾍﾟ":"pe", "ﾎﾟ":"po",

    "ｷｬ":"kya", "ｷｭ":"kyu", "ｷｮ":"kyo",
    "ｼｬ":"sha", "ｼｭ":"shu", "ｼｮ":"sho",
    "ﾁｬ":"cha", "ﾁｭ":"chu", "ﾁｮ":"cho",
    "ﾆｬ":"nya", "ﾆｭ":"nyu", "ﾆｮ":"nyo",
    "ﾋｬ":"hya", "ﾋｭ":"hyu", "ﾋｮ":"hyo",
    "ﾐｬ":"mya", "ﾐｭ":"myu", "ﾐｮ":"myo",
    "ﾘｬ":"rya", "ﾘｭ":"ryu", "ﾘｮ":"ryo",
    "ｷﾞｬ":"gya", "ｷﾞｭ":"gyu", "ｷﾞｮ":"gyo",
    "ｼﾞｬ":"ja", "ｼﾞｭ":"ju", "ｼﾞｮ":"jo",
    "ﾁﾞｬ":"dya", "ﾁﾞｭ":"dyu", "ﾁﾞｮ":"dyo",
    "ﾋﾞｬ":"bya", "ﾋﾞｭ":"byu", "ﾋﾞｮ":"byo",
    "ﾋﾟｬ":"pya", "ﾋﾟｭ":"pyu", "ﾋﾟｮ":"pyo",

};


/*===================================
==========  モールステーブル  =========
=====================================*/
const irohaCode = [
    ["あ","－－・－－"],
    ["い","・－"],
    ["う","・・－"],
    ["え","－・－－－"],
    ["お","・－・・・"],
    ["か","・－・・"],
    ["き","－・－・・"],
    ["く","・・・－"],
    ["け","－・－－"],
    ["こ","－－－－"],
    ["さ","－・－・－"],
    ["し","－－・－・"],
    ["す","－－－・－"],
    ["せ","・－－－・"],
    ["そ","－－－・"],
    ["た","－・"],
    ["ち","・・－・"],
    ["つ","・－－・"],
    ["て","・－・－－"],
    ["と","・・－・・"],
    ["な","・－・"],
    ["に","－・－・"],
    ["ぬ","・・・・"],
    ["ね","－－・－"],
    ["の","・・－－"],
    ["は","－・・・"],
    ["ひ","－－・・－"],
    ["ふ","－－・・"],
    ["へ","・"],
    ["ほ","－・・"],
    ["ま","－・・－"],
    ["み","・・－・－"],
    ["む","－"],
    ["め","－・・・－"],
    ["も","－・・－・"],
    ["や","・－－"],
    ["ゐ","・－・・－"],
    ["ゆ","－・・－－"],
    ["ゑ","・－－・・"],
    ["よ","－－"],
    ["ら","・・・"],
    ["り","－－・"],
    ["る","－・－－・"],
    ["れ","－－－"],
    ["ろ","・－・－"],
    ["わ","－・－"],
    ["を","・－－－"],
    ["ん","・－・－・"],
    ["が","・－・・／・・"],
    ["ぎ","－・－・・／・・"],
    ["ぐ","・・・－／・・"],
    ["げ","－・－－／・・"],
    ["ご","－－－－／・・"],
    ["ざ","－・－・－／・・"],
    ["じ","－－・－・／・・"],
    ["ず","－－－・－／・・"],
    ["ぜ","・－－－・／・・"],
    ["ぞ","－－－・／・・"],
    ["だ","－・／・・"],
    ["ぢ","・・－・／・・"],
    ["づ","・－－・／・・"],
    ["で","・－・－－／・・"],
    ["ど","・・－・・／・・"],
    ["ば","－・・・／・・"],
    ["び","－－・・－／・・"],
    ["ぶ","－－・・／・・"],
    ["べ","・／・・"],
    ["ぼ","－・・／・・"],
    ["ぱ","－・・・／・・－－・"],
    ["ぴ","－－・・－／・・－－・"],
    ["ぷ","－－・・／・・－－・"],
    ["ぺ","・／・・－－・"],
    ["ぽ","－・・／・・－－・"],
    ["ー","・－－・－"],
    ["、","・－・－・－"],
    ["。","・－・－・・"],
    ["(","－・－－・－"],
    [")","・－・・－・"],
    ["0","－－－－－"],
    ["1","・－－－－"],
    ["2","・・－－－"],
    ["3","・・・－－"],
    ["4","・・・・－"],
    ["5","・・・・・"],
    ["6","－・・・・"],
    ["7","－－・・・"],
    ["8","－－－・・"],
    ["9","－－－－・"],


    //小文字は対応していないので大文字と同じ
    ["ぁ","－－・－－"],
    ["ぃ","・－"],
    ["ぅ","・・－"],
    ["ぇ","－・－－－"],
    ["ぉ","・－・・・"],
    ["ゃ","・－－"],
    ["ゅ","－・・－－"],
    ["ょ","－－"],
    ["ゎ","－・－"],
    ["゛","・・"],
    ["゜","・・－－・"],
    ["\n","・－・－・・"],
    ["っ","・－－・"],
    ["",""],
    [" ","／"],
    ["　","／"],

    /*以下全角 */
    ["（","－・－－・－"], 
    ["）","・－・・－・"],
    ["０","－－－－－"],
    ["１","・－－－－"],
    ["２","・・－－－"],
    ["３","・・・－－"],
    ["４","・・・・－"],
    ["５","・・・・・"],
    ["６","－・・・・"],
    ["７","－－・・・"],
    ["８","－－－・・"],
    ["９","－－－－・"],

    /*カタカナ*/
    ["ア","－－・－－"],
    ["イ","・－"],
    ["ウ","・・－"],
    ["エ","－・－－－"],
    ["オ","・－・・・"],
    ["カ","・－・・"],
    ["キ","－・－・・"],
    ["ク","・・・－"],
    ["ケ","－・－－"],
    ["コ","－－－－"],
    ["サ","－・－・－"],
    ["シ","－－・－・"],
    ["ス","－－－・－"],
    ["セ","・－－－・"],
    ["ソ","－－－・"],
    ["タ","－・"],
    ["チ","・・－・"],
    ["ツ","・－－・"],
    ["テ","・－・－－"],
    ["ト","・・－・・"],
    ["ナ","・－・"],
    ["ニ","－・－・"],
    ["ヌ","・・・・"],
    ["ネ","－－・－"],
    ["ノ","・・－－"],
    ["ハ","－・・・"],
    ["ヒ","－－・・－"],
    ["フ","－－・・"],
    ["ヘ","・"],
    ["ホ","－・・"],
    ["マ","－・・－"],
    ["ミ","・・－・－"],
    ["ム","－"],
    ["メ","－・・・－"],
    ["モ","－・・－・"],
    ["ヤ","・－－"],
    ["ヰ","・－・・－"],
    ["ユ","－・・－－"],
    ["ヱ","・－－・・"],
    ["ヨ","－－"],
    ["ラ","・・・"],
    ["リ","－－・"],
    ["ル","－・－－・"],
    ["レ","－－－"],
    ["ロ","・－・－"],
    ["ワ","－・－"],
    ["ヲ","・－－－"],
    ["ン","・－・－・"],
    ["ガ","・－・・／・・"],
    ["ギ","－・－・・／・・"],
    ["グ","・・・－／・・"],
    ["ゲ","－・－－／・・"],
    ["ゴ","－－－－／・・"],
    ["ザ","－・－・－／・・"],
    ["ジ","－－・－・／・・"],
    ["ズ","－－－・－／・・"],
    ["ゼ","・－－－・／・・"],
    ["ゾ","－－－・／・・"],
    ["ダ","－・／・・"],
    ["ヂ","・・－・／・・"],
    ["ヅ","・－－・／・・"],
    ["デ","・－・－－／・・"],
    ["ド","・・－・・／・・"],
    ["バ","－・・・／・・"],
    ["ビ","－－・・－／・・"],
    ["ブ","－－・・／・・"],
    ["ベ","・／・・"],
    ["ボ","－・・／・・"],
    ["パ","－・・・／・・－－・"],
    ["ピ","－－・・－／・・－－・"],
    ["プ","－－・・／・・－－・"],
    ["ペ","・／・・－－・"],
    ["ポ","－・・／・・－－・"],

    /* 半角カタカナ */
    ["ｱ","－－・－－"],
    ["ｲ","・－"],
    ["ｳ","・・－"],
    ["ｴ","－・－－－"],
    ["ｵ","・－・・・"],
    ["ｶ","・－・・"],
    ["ｷ","－・－・・"],
    ["ｸ","・・・－"],
    ["ｹ","－・－－"],
    ["ｺ","－－－－"],
    ["ｻ","－・－・－"],
    ["ｼ","－－・－・"],
    ["ｽ","－－－・－"],
    ["ｾ","・－－－・"],
    ["ｿ","－－－・"],
    ["ﾀ","－・"],
    ["ﾁ","・・－・"],
    ["ﾂ","・－－・"],
    ["ﾃ","・－・－－"],
    ["ﾄ","・・－・・"],
    ["ﾅ","・－・"],
    ["ﾆ","－・－・"],
    ["ﾇ","・・・・"],
    ["ﾈ","－－・－"],
    ["ﾉ","・・－－"],
    ["ﾊ","－・・・"],
    ["ﾋ","－－・・－"],
    ["ﾌ","－－・・"],
    ["ﾍ","・"],
    ["ﾎ","－・・"],
    ["ﾏ","－・・－"],
    ["ﾐ","・・－・－"],
    ["ﾑ","－"],
    ["ﾒ","－・・・－"],
    ["ﾓ","－・・－・"],
    ["ﾔ","・－－"],
    ["ﾕ","－・・－－"],
    ["ﾖ","－－"],
    ["ﾗ","・・・"],
    ["ﾘ","－－・"],
    ["ﾙ","－・－－・"],
    ["ﾚ","－－－"],
    ["ﾛ","・－・－"],
    ["ﾜ","－・－"],
    ["ｦ","・－－－"],
    ["ﾝ","・－・－・"],
    ["ｶﾞ","・－・・／・・"],
    ["ｷﾞ","－・－・・／・・"],
    ["ｸﾞ","・・・－／・・"],
    ["ｹﾞ","－・－－／・・"],
    ["ｺﾞ","－－－－／・・"],
    ["ｻﾞ","－・－・－／・・"], 
    ["ｼﾞ","－－・－・／・・"], 
    ["ｽﾞ","－－－・－／・・"],
    ["ｾﾞ","・－－－・／・・"],
    ["ｿﾞ","－－－・／・・"],
    ["ﾀﾞ","－・／・・"], 
    ["ﾁﾞ","・・－・／・・"],
    ["ﾂﾞ","・－－・／・・"],
    ["ﾃﾞ","・－・－－／・・"],
    ["ﾄﾞ","・・－・・／・・"],
    ["ﾊﾞ","－・・・／・・"],
    ["ﾋﾞ","－－・・－／・・"],
    ["ﾌﾞ","－－・・／・・"],
    ["ﾍﾞ","・／・・"],
    ["ﾎﾞ","－・・／・・"],
    ["ﾊﾟ","－・・・／・・－－・"],
    ["ﾋﾟ","－－・・－／・・－－・"],
    ["ﾌﾟ","－－・・／・・－－・"],
    ["ﾍﾟ","・／・・－－・"],
    ["ﾎﾟ","－・・／・・－－・"],
];

///////////////////////////////////////////////
/////////// ローマ字モールス信号表 //////////////
///////////////////////////////////////////////

const romeCode = [
    // A-Z 0-9 記号
    ["A","・－"],
    ["B","－・・・"],
    ["C","－・－・"],
    ["D","－・・"],
    ["E","・"],
    ["F","・・－・"],
    ["G","－－・"],
    ["H","・・・・"],
    ["I","・・"],
    ["J","・－－－"],
    ["K","－・－"],
    ["L","・－・・"],
    ["M","－－"],
    ["N","－・"],
    ["O","－－－"],
    ["P","・－－・"],
    ["Q","－－・－"],
    ["R","・－・"],
    ["S","・・・"],
    ["T","－"],
    ["U","・・－"],
    ["V","・・・－"],
    ["W","・－－"],
    ["X","－・・－"],
    ["Y","－・－－"],
    ["Z","－－・・"],
    ["0","－－－－－"], 
    ["1","・－－－－"], 
    ["2","・・－－－"], 
    ["3","・・・－－"],
    ["4","・・・・－"], 
    ["5","・・・・・"], 
    ["6","－・・・・"],
    ["7","－－・・・"], 
    ["8","－－－・・"], 
    ["9","－－－－・"], 
    [".","・－・－・－"],
    [",","－－・・－－"],
    [":","－－－・・・"],
    ["?","・・－－・・"],
    ["'","・－－－－・"],
    ["－","－・・・・－"],
    ["(","－・－－・"],
    [")","－・－－・－"],
    ["/","－・・－・"],
    ["=","－・・・－"],
    ["+","・－・－・"],
    ['"',"・－・・－・"],
    ["×","－・・－"],
    ["@","・－－・－・"],


    // a-z (小文字)
    ["a","・－"],
    ["b","－・・・"],
    ["c","－・－・"],
    ["d","－・・"],
    ["e","・"],
    ["f","・・－・"],
    ["g","－－・"],
    ["h","・・・・"],
    ["i","・・"],
    ["j","・－－－"],
    ["k","－・－"],
    ["l","・－・・"],
    ["m","－－"],
    ["n","－・"],
    ["o","－－－"],
    ["p","・－－・"],
    ["q","－－・－"],
    ["r","・－・"],
    ["s","・・・"],
    ["t","－"],
    ["u","・・－"],
    ["v","・・・－"],
    ["w","・－－"],
    ["x","－・・－"],
    ["y","－・－－"],
    ["z","－－・・"],


    // 全角 A-Z a-z 0-9 記号
    ["Ａ","・－"],
    ["Ｂ","－・・・"],
    ["Ｃ","－・－・"],
    ["Ｄ","－・・"],
    ["Ｅ","・"],
    ["Ｆ","・・－・"],
    ["Ｇ","－－・"],
    ["Ｈ","・・・・"],
    ["Ｉ","・・"],
    ["Ｊ","・－－－"],
    ["Ｋ","－・－"],
    ["Ｌ","・－・・"],
    ["Ｍ","－－"],
    ["Ｎ","－・"],
    ["Ｏ","－－－"],
    ["Ｐ","・－－・"],
    ["Ｑ","－－・－"],
    ["Ｒ","・－・"],
    ["Ｓ","・・・"],
    ["Ｔ","－"],
    ["Ｕ","・・－"],
    ["Ｖ","・・・－"],
    ["Ｗ","・－－"],
    ["Ｘ","－・・－"],
    ["Ｙ","－・－－"],
    ["Ｚ","－－・・"],
    ["ａ","・－"],
    ["ｂ","－・・・"],
    ["ｃ","－・－・"],
    ["ｄ","－・・"],
    ["ｅ","・"],
    ["ｆ","・・－・"],
    ["ｇ","－－・"],
    ["ｈ","・・・・"],
    ["ｉ","・・"],
    ["ｊ","・－－－"],
    ["ｋ","－・－"],
    ["ｌ","・－・・"],
    ["ｍ","－－"],
    ["ｎ","－・"],
    ["ｏ","－－－"],
    ["ｐ","・－－・"],
    ["ｑ","－－・－"],
    ["ｒ","・－・"],
    ["ｓ","・・・"],
    ["ｔ","－"],
    ["ｕ","・・－"],
    ["ｖ","・・・－"],
    ["ｗ","・－－"],
    ["ｘ","－・・－"],
    ["ｙ","－・－－"],
    ["ｚ","－－・・"],
    ["(","－・－－・－"],
    [")","・－・・－・"],
    ["０","－－－－－"],
    ["１","・－－－－"],
    ["２","・・－－－"],
    ["３","・・・－－"],
    ["４","・・・・－"],
    ["５","・・・・・"],
    ["６","－・・・・"],
    ["７","－－・・・"],
    ["８","－－－・・"],
    ["９","－－－－・"],
    [" ","／"],
    ["　","／"]
];

function getLastOfCorrespond(){return lastOfCorrespond;}
function getRowUrl(){return rawUrl;}
function getShareMessage(){
    lang = getCurrentLanguage();
    if(lang === "English"){return shareMessage_English;}
    else{return shareMessage_Japanese;}
}
function getHashTags(){
    lang = getCurrentLanguage();
    if(lang === "English"){return hashTags_English;}
    else{return hashTags_Japanese;}
}
function getmap(FT){
    if(FT === "HtR"){return HtR;}
    else if(FT === "RtH"){return RtH;}
    return {};
}
function getMorseCodeTable(languageName){
    if(languageName == "日本語") return irohaCode;
    else return romeCode;
}

function getDot(){return dot;}
function getDash(){return dash;}
function getSeparator(){return separator;}
function getUnknown(){return unknown;}

function setDot(dotValue){dot = dotValue;}
function setDash(dashValue){dash = dashValue;}
function setSeparator(separatorValue){separator = separatorValue;}
function setUnknown(unknownValue){unknown = unknownValue;}